{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/sofiacorona/Desktop/Presentacion 24 feb.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Mar 2022, 19:40:26
{txt}
{com}. 
. use "/Users/sofiacorona/Desktop/Bases de Datos/ENOE/SDEMT419.dta"
{txt}
{com}. 
. ****** 4T2019 ********
. *exploracion de sdemt419
. 
. ** Cambiar nombres de las variables a minÃºsculas.  Solo para 4T19 y 3T19
. 
. rename *, lower
{res}{txt}
{com}. 
. ***generar variable de lugar de nacimiento
. 
. * nacido en MÃ©xico = 0, nacido en Guatemala = 1, nacido en resto de America = 2, nacido en USA = 3, nacido en Europa = 4, nacido en Africa y Asia = 5 (siempre arrancar con missing para que no se introduzcan los missing en la categorÃ­a igual a cero)
. 
. generate lugar_nacimiento = .
{txt}(402,536 missing values generated)

{com}. replace lugar_nacimiento = 0 if l_nac_c <= 33
{txt}(391,933 real changes made)

{com}. replace lugar_nacimiento = 1 if l_nac_c == 225
{txt}(220 real changes made)

{com}. replace lugar_nacimiento = 2 if l_nac_c == 200
{txt}(600 real changes made)

{com}. replace lugar_nacimiento = 3 if l_nac_c == 221
{txt}(2,422 real changes made)

{com}. replace lugar_nacimiento = 4 if l_nac_c == 400  |  l_nac_c == 415
{txt}(138 real changes made)

{com}. replace lugar_nacimiento = 5 if l_nac_c == 100  |  l_nac_c == 300 | l_nac_c == 500  |  l_nac_c == 600
{txt}(68 real changes made)

{com}. 
. *** generar variable de interÃ©s, migrantes de latam (incluye CanadÃ¡)
. * DicotÃ³mica. Vale uno para los nacidos en guatemala y el resto de america (no incluye USA).  Vale cero para nacidos en MÃ©xico, USA, Europa, Africa y Asia.
. 
. generate latam = .
{txt}(402,536 missing values generated)

{com}. replace latam = 0 if lugar_nacimiento == 0 | lugar_nacimiento == 3 | lugar_nacimiento == 4 |lugar_nacimiento == 5
{txt}(394,561 real changes made)

{com}. replace latam = 1 if lugar_nacimiento == 1  | lugar_nacimiento == 2
{txt}(820 real changes made)

{com}. 
. *generar regiones de la RepÃºblica.  Norte = 1, Centro = 2 y Sur = 3.
. 
. generate region = .
{txt}(402,536 missing values generated)

{com}. replace region = 1 if ent == 2 | ent == 3 | ent == 8 | ent == 10 | ent == 25 | ent == 26 | ent == 5 | ent == 19 | ent == 28
{txt}(121,006 real changes made)

{com}. 
. replace region = 2 if ent == 1 | ent == 6 | ent == 9 | ent == 11 | ent == 13 | ent == 14 | ent == 15 | ent == 16 | ent == 17  | ent == 18 | ent == 19 | ent == 21 | ent == 22 | ent == 24 | ent == 29 | ent == 30 | ent == 32
{txt}(211,198 real changes made)

{com}. 
. replace region = 3 if ent == 7 | ent == 12 | ent == 20 | ent == 4 | ent == 23 | ent == 27 | ent == 31
{txt}(83,457 real changes made)

{com}. 
. * generar variable de educaciÃ³n.
. generate grado_edu = .
{txt}(402,536 missing values generated)

{com}. replace grado_edu = 1 if cs_p13_1 <= 2 | cs_p13_1 == 99 // primaria o menos mÃ¡s no sabe
{txt}(130,924 real changes made)

{com}. replace grado_edu = 2 if cs_p13_1 == 3 // secundaria
{txt}(94,578 real changes made)

{com}. replace grado_edu = 3 if cs_p13_1 == 4 | cs_p13_1 == 5 | cs_p13_1 == 6 // preparatoria, normal y carrera tÃ©cnica
{txt}(79,217 real changes made)

{com}. replace grado_edu = 4 if cs_p13_1 == 7 // profesional
{txt}(58,301 real changes made)

{com}. replace grado_edu = 5 if cs_p13_1 == 8 | cs_p13_1 == 9 // maestria y doctorado
{txt}(4,711 real changes made)

{com}.  
. 
. *tabular educaciÃ³n
. 
. tab grado_edu if latam == 1 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}    102,588       37.15       37.15
{txt}          2 {c |}{res}     30,552       11.06       48.21
{txt}          3 {c |}{res}     39,696       14.37       62.58
{txt}          4 {c |}{res}     82,425       29.85       92.43
{txt}          5 {c |}{res}     20,906        7.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    276,167      100.00
{txt}
{com}. tab grado_edu if latam == 0 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res} 44,981,588       38.71       38.71
{txt}          2 {c |}{res} 30,029,055       25.84       64.56
{txt}          3 {c |}{res} 23,863,373       20.54       85.09
{txt}          4 {c |}{res} 16,079,842       13.84       98.93
{txt}          5 {c |}{res}  1,241,919        1.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}116,195,777      100.00
{txt}
{com}. 
. *tabular educaciÃ³n para mayores de 18 aÃ±os
. 
. tab grado_edu if latam == 1 & eda >= 18 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     66,174       28.45       28.45
{txt}          2 {c |}{res}     24,756       10.64       39.10
{txt}          3 {c |}{res}     38,307       16.47       55.57
{txt}          4 {c |}{res}     82,425       35.44       91.01
{txt}          5 {c |}{res}     20,906        8.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    232,568      100.00
{txt}
{com}. tab grado_edu if latam == 0 & eda >= 18 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res} 25,816,930       29.45       29.45
{txt}          2 {c |}{res} 22,881,456       26.10       55.55
{txt}          3 {c |}{res} 21,646,613       24.69       80.24
{txt}          4 {c |}{res} 16,077,263       18.34       98.58
{txt}          5 {c |}{res}  1,241,919        1.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res} 87,664,181      100.00
{txt}
{com}. 
. ******. Generamos Tabuladores *****
. 
. tabulate latam [fweight = fac]

      {txt}latam {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}125,234,866       99.77       99.77
{txt}          1 {c |}{res}    288,747        0.23      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}125,523,613      100.00
{txt}
{com}. tabulate latam region [fweight = fac], row column
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}              region
     latam {c |}         1          2          3 {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
         0 {c |}{res}  22667944   82114483   20452439 {txt}{c |}{res} 125234866 
           {txt}{c |}{res}     18.10      65.57      16.33 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     99.84      99.84      99.41 {txt}{c |}{res}     99.77 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
         1 {c |}{res}     35313     131442     121992 {txt}{c |}{res}    288747 
           {txt}{c |}{res}     12.23      45.52      42.25 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}      0.16       0.16       0.59 {txt}{c |}{res}      0.23 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}  22703257   82245925   20574431 {txt}{c |}{res} 125523613 
           {txt}{c |}{res}     18.09      65.52      16.39 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. tabulate latam sex [fweight = fac], row column
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}         Sexo
     latam {c |}    Hombre      Mujer {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}  60377068   64857798 {txt}{c |}{res} 125234866 
           {txt}{c |}{res}     48.21      51.79 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     99.76      99.78 {txt}{c |}{res}     99.77 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}    144300     144447 {txt}{c |}{res}    288747 
           {txt}{c |}{res}     49.97      50.03 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}      0.24       0.22 {txt}{c |}{res}      0.23 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}  60521368   65002245 {txt}{c |}{res} 125523613 
           {txt}{c |}{res}     48.22      51.78 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. ** Todas las regiones
. 
. * Latam
. tab eda5c if latam ==1 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}     47,754       16.54       16.54
{txt}        14 a 24 años {c |}{res}     37,026       12.82       29.36
{txt}        25 a 44 años {c |}{res}    116,338       40.29       69.65
{txt}        45 a 64 años {c |}{res}     68,082       23.58       93.23
{txt}       65 años y más {c |}{res}     19,547        6.77      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}    288,747      100.00
{txt}
{com}. tab pos_ocu if latam ==1 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}    128,405       44.47       44.47
{txt}Trabajadores subordinados y remunerados {c |}{res}    117,159       40.57       85.04
{txt}                            Empleadores {c |}{res}      9,144        3.17       88.21
{txt}         Trabajadores por cuenta propia {c |}{res}     28,144        9.75       97.96
{txt}                  Trabajadores sin pago {c |}{res}      5,895        2.04      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}    288,747      100.00
{txt}
{com}. tab emp_ppal if latam ==1 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}    128,405       44.47       44.47
{txt}Empleo informal {c |}{res}     89,980       31.16       75.63
{txt}  Empleo formal {c |}{res}     70,362       24.37      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}    288,747      100.00
{txt}
{com}. tab clase2 if latam ==1 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}     36,421       12.61       12.61
{txt}   Población ocupada {c |}{res}    160,342       55.53       68.14
{txt}Población desocupada {c |}{res}      7,290        2.52       70.67
{txt}         Disponibles {c |}{res}     17,168        5.95       76.61
{txt}      No disponibles {c |}{res}     67,526       23.39      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}    288,747      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 30,744,391       24.55       24.55
{txt}        14 a 24 años {c |}{res} 21,625,880       17.27       41.82
{txt}        25 a 44 años {c |}{res} 35,027,128       27.97       69.79
{txt}        45 a 64 años {c |}{res} 26,454,715       21.12       90.91
{txt}       65 años y más {c |}{res} 11,303,661        9.03       99.94
{txt}Edad no especificado {c |}{res}     79,091        0.06      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}125,234,866      100.00
{txt}
{com}. tab pos_ocu if latam ==0 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 69,594,128       55.57       55.57
{txt}Trabajadores subordinados y remunerados {c |}{res} 37,892,937       30.26       85.83
{txt}                            Empleadores {c |}{res}  2,657,886        2.12       87.95
{txt}         Trabajadores por cuenta propia {c |}{res} 12,366,983        9.88       97.83
{txt}                  Trabajadores sin pago {c |}{res}  2,722,932        2.17      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}125,234,866      100.00
{txt}
{com}. tab emp_ppal if latam ==0 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 69,594,128       55.57       55.57
{txt}Empleo informal {c |}{res} 31,405,594       25.08       80.65
{txt}  Empleo formal {c |}{res} 24,235,144       19.35      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}125,234,866      100.00
{txt}
{com}. tab clase2 if latam ==0 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 24,028,716       19.19       19.19
{txt}   Población ocupada {c |}{res} 55,640,738       44.43       63.62
{txt}Población desocupada {c |}{res}  1,929,860        1.54       65.16
{txt}         Disponibles {c |}{res}  6,158,803        4.92       70.07
{txt}      No disponibles {c |}{res} 37,476,749       29.93      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}125,234,866      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 30,332,582       24.37       24.37
{txt}        14 a 24 años {c |}{res} 21,423,111       17.21       41.59
{txt}        25 a 44 años {c |}{res} 34,935,097       28.07       69.66
{txt}        45 a 64 años {c |}{res} 26,409,311       21.22       90.88
{txt}       65 años y más {c |}{res} 11,266,683        9.05       99.94
{txt}Edad no especificado {c |}{res}     78,022        0.06      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}124,444,806      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 68,955,592       55.41       55.41
{txt}Trabajadores subordinados y remunerados {c |}{res} 37,780,518       30.36       85.77
{txt}                            Empleadores {c |}{res}  2,649,507        2.13       87.90
{txt}         Trabajadores por cuenta propia {c |}{res} 12,353,122        9.93       97.83
{txt}                  Trabajadores sin pago {c |}{res}  2,706,067        2.17      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}124,444,806      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 68,955,592       55.41       55.41
{txt}Empleo informal {c |}{res} 31,308,795       25.16       80.57
{txt}  Empleo formal {c |}{res} 24,180,419       19.43      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}124,444,806      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 23,756,708       19.09       19.09
{txt}   Población ocupada {c |}{res} 55,489,214       44.59       63.68
{txt}Población desocupada {c |}{res}  1,923,050        1.55       65.22
{txt}         Disponibles {c |}{res}  6,127,119        4.92       70.15
{txt}      No disponibles {c |}{res} 37,148,715       29.85      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}124,444,806      100.00
{txt}
{com}. 
. * Por lugar de nacimiento
. tab lugar_nacimiento [fweight = fac]

{txt}lugar_nacim {c |}
      iento {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}124,444,806       99.14       99.14
{txt}          1 {c |}{res}     92,082        0.07       99.21
{txt}          2 {c |}{res}    196,665        0.16       99.37
{txt}          3 {c |}{res}    726,665        0.58       99.95
{txt}          4 {c |}{res}     40,031        0.03       99.98
{txt}          5 {c |}{res}     23,364        0.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}125,523,613      100.00
{txt}
{com}. 
. 
. 
. 
. *** Region Norte
. 
. * Latam
. tab eda5c if latam ==1 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      5,447       15.42       15.42
{txt}        14 a 24 años {c |}{res}      5,670       16.06       31.48
{txt}        25 a 44 años {c |}{res}     12,095       34.25       65.73
{txt}        45 a 64 años {c |}{res}      9,503       26.91       92.64
{txt}       65 años y más {c |}{res}      2,598        7.36      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     35,313      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 1 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     15,106       42.78       42.78
{txt}Trabajadores subordinados y remunerados {c |}{res}     14,150       40.07       82.85
{txt}                            Empleadores {c |}{res}        467        1.32       84.17
{txt}         Trabajadores por cuenta propia {c |}{res}      4,739       13.42       97.59
{txt}                  Trabajadores sin pago {c |}{res}        851        2.41      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}     35,313      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 1 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     15,106       42.78       42.78
{txt}Empleo informal {c |}{res}      8,986       25.45       68.22
{txt}  Empleo formal {c |}{res}     11,221       31.78      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}     35,313      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      4,510       12.77       12.77
{txt}   Población ocupada {c |}{res}     20,207       57.22       69.99
{txt}Población desocupada {c |}{res}      1,045        2.96       72.95
{txt}         Disponibles {c |}{res}      1,252        3.55       76.50
{txt}      No disponibles {c |}{res}      8,299       23.50      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     35,313      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,570,460       24.57       24.57
{txt}        14 a 24 años {c |}{res}  4,004,021       17.66       42.24
{txt}        25 a 44 años {c |}{res}  6,272,027       27.67       69.91
{txt}        45 a 64 años {c |}{res}  4,982,764       21.98       91.89
{txt}       65 años y más {c |}{res}  1,832,214        8.08       99.97
{txt}Edad no especificado {c |}{res}      6,458        0.03      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 22,667,944      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 1 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 12,328,118       54.39       54.39
{txt}Trabajadores subordinados y remunerados {c |}{res}  7,917,130       34.93       89.31
{txt}                            Empleadores {c |}{res}    516,515        2.28       91.59
{txt}         Trabajadores por cuenta propia {c |}{res}  1,688,165        7.45       99.04
{txt}                  Trabajadores sin pago {c |}{res}    218,016        0.96      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 22,667,944      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 1 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 12,328,118       54.39       54.39
{txt}Empleo informal {c |}{res}  4,305,658       18.99       73.38
{txt}  Empleo formal {c |}{res}  6,034,168       26.62      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 22,667,944      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,319,696       19.06       19.06
{txt}   Población ocupada {c |}{res} 10,339,826       45.61       64.67
{txt}Población desocupada {c |}{res}    335,598        1.48       66.15
{txt}         Disponibles {c |}{res}  1,074,993        4.74       70.89
{txt}      No disponibles {c |}{res}  6,597,831       29.11      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 22,667,944      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,355,268       24.02       24.02
{txt}        14 a 24 años {c |}{res}  3,917,332       17.57       41.59
{txt}        25 a 44 años {c |}{res}  6,226,064       27.92       69.51
{txt}        45 a 64 años {c |}{res}  4,965,948       22.27       91.78
{txt}       65 años y más {c |}{res}  1,825,728        8.19       99.97
{txt}Edad no especificado {c |}{res}      6,290        0.03      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 22,296,630      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 1 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 12,018,810       53.90       53.90
{txt}Trabajadores subordinados y remunerados {c |}{res}  7,865,778       35.28       89.18
{txt}                            Empleadores {c |}{res}    514,526        2.31       91.49
{txt}         Trabajadores por cuenta propia {c |}{res}  1,682,575        7.55       99.04
{txt}                  Trabajadores sin pago {c |}{res}    214,941        0.96      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 22,296,630      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 1 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 12,018,810       53.90       53.90
{txt}Empleo informal {c |}{res}  4,255,987       19.09       72.99
{txt}  Empleo formal {c |}{res}  6,021,833       27.01      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 22,296,630      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,157,148       18.64       18.64
{txt}   Población ocupada {c |}{res} 10,277,820       46.10       64.74
{txt}Población desocupada {c |}{res}    331,971        1.49       66.23
{txt}         Disponibles {c |}{res}  1,062,084        4.76       70.99
{txt}      No disponibles {c |}{res}  6,467,607       29.01      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 22,296,630      100.00
{txt}
{com}. 
. 
. *** Region Centro
. 
. * Latam
. tab eda5c if latam ==1 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}     12,515        9.52        9.52
{txt}        14 a 24 años {c |}{res}     10,942        8.32       17.85
{txt}        25 a 44 años {c |}{res}     57,760       43.94       61.79
{txt}        45 a 64 años {c |}{res}     36,454       27.73       89.52
{txt}       65 años y más {c |}{res}     13,771       10.48      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}    131,442      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 2 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     55,104       41.92       41.92
{txt}Trabajadores subordinados y remunerados {c |}{res}     60,907       46.34       88.26
{txt}                            Empleadores {c |}{res}      6,025        4.58       92.84
{txt}         Trabajadores por cuenta propia {c |}{res}      8,634        6.57       99.41
{txt}                  Trabajadores sin pago {c |}{res}        772        0.59      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}    131,442      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 2 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     55,104       41.92       41.92
{txt}Empleo informal {c |}{res}     27,417       20.86       62.78
{txt}  Empleo formal {c |}{res}     48,921       37.22      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}    131,442      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      9,425        7.17        7.17
{txt}   Población ocupada {c |}{res}     76,338       58.08       65.25
{txt}Población desocupada {c |}{res}      3,577        2.72       67.97
{txt}         Disponibles {c |}{res}     10,766        8.19       76.16
{txt}      No disponibles {c |}{res}     31,336       23.84      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}    131,442      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 19,504,537       23.75       23.75
{txt}        14 a 24 años {c |}{res} 14,171,700       17.26       41.01
{txt}        25 a 44 años {c |}{res} 23,121,296       28.16       69.17
{txt}        45 a 64 años {c |}{res} 17,539,141       21.36       90.53
{txt}       65 años y más {c |}{res}  7,716,080        9.40       99.92
{txt}Edad no especificado {c |}{res}     61,729        0.08      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 82,114,483      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 2 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 45,684,877       55.64       55.64
{txt}Trabajadores subordinados y remunerados {c |}{res} 25,178,964       30.66       86.30
{txt}                            Empleadores {c |}{res}  1,669,615        2.03       88.33
{txt}         Trabajadores por cuenta propia {c |}{res}  7,925,135        9.65       97.98
{txt}                  Trabajadores sin pago {c |}{res}  1,655,892        2.02      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 82,114,483      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 2 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 45,684,877       55.64       55.64
{txt}Empleo informal {c |}{res} 20,890,686       25.44       81.08
{txt}  Empleo formal {c |}{res} 15,538,920       18.92      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 82,114,483      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 15,223,430       18.54       18.54
{txt}   Población ocupada {c |}{res} 36,429,606       44.36       62.90
{txt}Población desocupada {c |}{res}  1,353,726        1.65       64.55
{txt}         Disponibles {c |}{res}  4,149,493        5.05       69.61
{txt}      No disponibles {c |}{res} 24,958,228       30.39      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 82,114,483      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 19,325,226       23.64       23.64
{txt}        14 a 24 años {c |}{res} 14,065,298       17.21       40.85
{txt}        25 a 44 años {c |}{res} 23,080,106       28.24       69.09
{txt}        45 a 64 años {c |}{res} 17,514,509       21.43       90.52
{txt}       65 años y más {c |}{res}  7,688,299        9.41       99.93
{txt}Edad no especificado {c |}{res}     60,828        0.07      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 81,734,266      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 2 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 45,384,688       55.53       55.53
{txt}Trabajadores subordinados y remunerados {c |}{res} 25,121,786       30.74       86.26
{txt}                            Empleadores {c |}{res}  1,664,563        2.04       88.30
{txt}         Trabajadores por cuenta propia {c |}{res}  7,917,895        9.69       97.99
{txt}                  Trabajadores sin pago {c |}{res}  1,645,334        2.01      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 81,734,266      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 2 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 45,384,688       55.53       55.53
{txt}Empleo informal {c |}{res} 20,848,527       25.51       81.03
{txt}  Empleo formal {c |}{res} 15,501,051       18.97      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 81,734,266      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 15,123,653       18.50       18.50
{txt}   Población ocupada {c |}{res} 36,349,578       44.47       62.98
{txt}Población desocupada {c |}{res}  1,350,617        1.65       64.63
{txt}         Disponibles {c |}{res}  4,133,380        5.06       69.69
{txt}      No disponibles {c |}{res} 24,777,038       30.31      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 81,734,266      100.00
{txt}
{com}. 
. 
. *** Region Sur
. 
. * Latam
. tab eda5c if latam ==1 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}     29,792       24.42       24.42
{txt}        14 a 24 años {c |}{res}     20,414       16.73       41.16
{txt}        25 a 44 años {c |}{res}     46,483       38.10       79.26
{txt}        45 a 64 años {c |}{res}     22,125       18.14       97.39
{txt}       65 años y más {c |}{res}      3,178        2.61      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}    121,992      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 3 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     58,195       47.70       47.70
{txt}Trabajadores subordinados y remunerados {c |}{res}     42,102       34.51       82.22
{txt}                            Empleadores {c |}{res}      2,652        2.17       84.39
{txt}         Trabajadores por cuenta propia {c |}{res}     14,771       12.11       96.50
{txt}                  Trabajadores sin pago {c |}{res}      4,272        3.50      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}    121,992      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 3 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     58,195       47.70       47.70
{txt}Empleo informal {c |}{res}     53,577       43.92       91.62
{txt}  Empleo formal {c |}{res}     10,220        8.38      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}    121,992      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}     22,486       18.43       18.43
{txt}   Población ocupada {c |}{res}     63,797       52.30       70.73
{txt}Población desocupada {c |}{res}      2,668        2.19       72.92
{txt}         Disponibles {c |}{res}      5,150        4.22       77.14
{txt}      No disponibles {c |}{res}     27,891       22.86      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}    121,992      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,669,394       27.72       27.72
{txt}        14 a 24 años {c |}{res}  3,450,159       16.87       44.59
{txt}        25 a 44 años {c |}{res}  5,633,805       27.55       72.13
{txt}        45 a 64 años {c |}{res}  3,932,810       19.23       91.36
{txt}       65 años y más {c |}{res}  1,755,367        8.58       99.95
{txt}Edad no especificado {c |}{res}     10,904        0.05      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 20,452,439      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 3 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 11,581,133       56.62       56.62
{txt}Trabajadores subordinados y remunerados {c |}{res}  4,796,843       23.45       80.08
{txt}                            Empleadores {c |}{res}    471,756        2.31       82.38
{txt}         Trabajadores por cuenta propia {c |}{res}  2,753,683       13.46       95.85
{txt}                  Trabajadores sin pago {c |}{res}    849,024        4.15      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 20,452,439      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 3 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 11,581,133       56.62       56.62
{txt}Empleo informal {c |}{res}  6,209,250       30.36       86.98
{txt}  Empleo formal {c |}{res}  2,662,056       13.02      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 20,452,439      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,485,590       21.93       21.93
{txt}   Población ocupada {c |}{res}  8,871,306       43.38       65.31
{txt}Población desocupada {c |}{res}    240,536        1.18       66.48
{txt}         Disponibles {c |}{res}    934,317        4.57       71.05
{txt}      No disponibles {c |}{res}  5,920,690       28.95      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 20,452,439      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
población de 14 años {c |}
 y más: Grupo edad 5 {c |}
              claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,652,088       27.69       27.69
{txt}        14 a 24 años {c |}{res}  3,440,481       16.85       44.54
{txt}        25 a 44 años {c |}{res}  5,628,927       27.57       72.12
{txt}        45 a 64 años {c |}{res}  3,928,854       19.25       91.36
{txt}       65 años y más {c |}{res}  1,752,656        8.59       99.95
{txt}Edad no especificado {c |}{res}     10,904        0.05      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 20,413,910      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 3 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 11,552,094       56.59       56.59
{txt}Trabajadores subordinados y remunerados {c |}{res}  4,792,954       23.48       80.07
{txt}                            Empleadores {c |}{res}    470,418        2.30       82.37
{txt}         Trabajadores por cuenta propia {c |}{res}  2,752,652       13.48       95.86
{txt}                  Trabajadores sin pago {c |}{res}    845,792        4.14      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 20,413,910      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 3 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 11,552,094       56.59       56.59
{txt}Empleo informal {c |}{res}  6,204,281       30.39       86.98
{txt}  Empleo formal {c |}{res}  2,657,535       13.02      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 20,413,910      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
población en ocupada {c |}
       y desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,475,907       21.93       21.93
{txt}   Población ocupada {c |}{res}  8,861,816       43.41       65.34
{txt}Población desocupada {c |}{res}    240,462        1.18       66.51
{txt}         Disponibles {c |}{res}    931,655        4.56       71.08
{txt}      No disponibles {c |}{res}  5,904,070       28.92      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 20,413,910      100.00
{txt}
{com}. 
. 
. 
. 
. ********* 4T2005 ***************
. 
. *exploracion de sdemt405
. 
. clear
{txt}
{com}. 
. cd "/Users/sofiacorona/Desktop/Bases de Datos"
{res}/Users/sofiacorona/Desktop/Bases de Datos
{txt}
{com}. 
. use "/Users/sofiacorona/Desktop/Bases de Datos/ENOE/SDEMT405.dta"
{txt}
{com}. 
. ***generar variable de lugar de nacimiento
. 
. * nacido en MÃ©xico = 0, nacido en Guatemala = 1, nacido en resto de America = 2, nacido en USA = 3, nacido en Europa = 4, nacido en Africa y Asia = 5 (siempre arrancar con missing para que no se introduzcan los missing en la categorÃ­a igual a cero)
. 
. generate lugar_nacimiento = .
{txt}(423,757 missing values generated)

{com}. replace lugar_nacimiento = 0 if l_nac_c <= 33
{txt}(413,706 real changes made)

{com}. replace lugar_nacimiento = 1 if l_nac_c == 225
{txt}(110 real changes made)

{com}. replace lugar_nacimiento = 2 if l_nac_c == 200
{txt}(284 real changes made)

{com}. replace lugar_nacimiento = 3 if l_nac_c == 221 |  l_nac_c == 201
{txt}(1,541 real changes made)

{com}. replace lugar_nacimiento = 4 if l_nac_c == 400  |  l_nac_c == 415
{txt}(179 real changes made)

{com}. replace lugar_nacimiento = 5 if l_nac_c == 100  |  l_nac_c == 300 | l_nac_c == 500  |  l_nac_c == 600
{txt}(55 real changes made)

{com}. 
. *** generar variable de interÃ©s, migrantes de latam (incluye CanadÃ¡)
. * DicotÃ³mica. Vale uno para los nacidos en guatemala y el resto de america (no incluye USA).  Vale cero para nacidos en MÃ©xico, USA, Europa, Africa y Asia.
. 
. generate latam = .
{txt}(423,757 missing values generated)

{com}. replace latam = 0 if lugar_nacimiento == 0 | lugar_nacimiento == 3 | lugar_nacimiento == 4 |lugar_nacimiento == 5
{txt}(415,481 real changes made)

{com}. replace latam = 1 if lugar_nacimiento == 1  | lugar_nacimiento == 2
{txt}(394 real changes made)

{com}. 
. *generar regiones de la RepÃºblica.  Norte = 1, Centro = 2 y Sur = 3.
. 
. generate region = .
{txt}(423,757 missing values generated)

{com}. replace region = 1 if ent == 2 | ent == 3 | ent == 8 | ent == 10 | ent == 25 | ent == 26 | ent == 5 | ent == 19 | ent == 28
{txt}(111,913 real changes made)

{com}. 
. replace region = 2 if ent == 1 | ent == 6 | ent == 9 | ent == 11 | ent == 13 | ent == 14 | ent == 15 | ent == 16 | ent == 17  | ent == 18 | ent == 19 | ent == 21 | ent == 22 | ent == 24 | ent == 29 | ent == 30 | ent == 32
{txt}(236,252 real changes made)

{com}. 
. replace region = 3 if ent == 7 | ent == 12 | ent == 20 | ent == 4 | ent == 23 | ent == 27 | ent == 31
{txt}(90,202 real changes made)

{com}. 
. 
. ******. Generamos Tabuladores *****
. 
. tabulate latam [fweight = fac]

      {txt}latam {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}107,587,682       99.92       99.92
{txt}          1 {c |}{res}     87,486        0.08      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}107,675,168      100.00
{txt}
{com}. tabulate latam region [fweight = fac], row column
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}              region
     latam {c |}         1          2          3 {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
         0 {c |}{res}  19264893   70795917   17526872 {txt}{c |}{res} 107587682 
           {txt}{c |}{res}     17.91      65.80      16.29 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     99.96      99.92      99.87 {txt}{c |}{res}     99.92 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
         1 {c |}{res}      7428      57428      22630 {txt}{c |}{res}     87486 
           {txt}{c |}{res}      8.49      65.64      25.87 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}      0.04       0.08       0.13 {txt}{c |}{res}      0.08 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}  19272321   70853345   17549502 {txt}{c |}{res} 107675168 
           {txt}{c |}{res}     17.90      65.80      16.30 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. * generar variable de educaciÃ³n.
. generate grado_edu = .
{txt}(423,757 missing values generated)

{com}. replace grado_edu = 1 if cs_p13_1 <= 2 | cs_p13_1 == 99 // primaria o menos mÃ¡s no sabe
{txt}(186,804 real changes made)

{com}. replace grado_edu = 2 if cs_p13_1 == 3 // secundaria
{txt}(84,283 real changes made)

{com}. replace grado_edu = 3 if cs_p13_1 == 4 | cs_p13_1 == 5 | cs_p13_1 == 6 // preparatoria, normal y carrera tÃ©cnica
{txt}(64,847 real changes made)

{com}. replace grado_edu = 4 if cs_p13_1 == 7 // profesional
{txt}(39,397 real changes made)

{com}. replace grado_edu = 5 if cs_p13_1 == 8 | cs_p13_1 == 9 // maestria y doctorado
{txt}(2,703 real changes made)

{com}. 
. *tabular educaciÃ³n
. 
. tab grado_edu if latam == 1 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     25,116       29.35       29.35
{txt}          2 {c |}{res}      9,226       10.78       40.13
{txt}          3 {c |}{res}     19,177       22.41       62.54
{txt}          4 {c |}{res}     27,080       31.65       94.19
{txt}          5 {c |}{res}      4,971        5.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     85,570      100.00
{txt}
{com}. tab grado_edu if latam == 0 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res} 51,943,106       53.32       53.32
{txt}          2 {c |}{res} 21,391,251       21.96       75.28
{txt}          3 {c |}{res} 15,068,697       15.47       90.75
{txt}          4 {c |}{res}  8,436,663        8.66       99.41
{txt}          5 {c |}{res}    577,145        0.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res} 97,416,862      100.00
{txt}
{com}. 
. *tabular educaciÃ³n para mayores de 18 aÃ±os
. 
. tab grado_edu if latam == 1 & eda >= 18 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     18,055       24.04       24.04
{txt}          2 {c |}{res}      6,702        8.92       32.97
{txt}          3 {c |}{res}     18,290       24.35       57.32
{txt}          4 {c |}{res}     27,080       36.06       93.38
{txt}          5 {c |}{res}      4,971        6.62      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     75,098      100.00
{txt}
{com}. tab grado_edu if latam == 0 & eda >= 18 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res} 29,850,295       44.43       44.43
{txt}          2 {c |}{res} 14,700,491       21.88       66.31
{txt}          3 {c |}{res} 13,625,915       20.28       86.59
{txt}          4 {c |}{res}  8,434,667       12.55       99.14
{txt}          5 {c |}{res}    577,145        0.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res} 67,188,513      100.00
{txt}
{com}. 
. 
. ** Todas las regiones
. 
. * Latam
. tab eda5c if latam ==1 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}     10,811       12.36       12.36
{txt}        14 a 24 aÃ±os {c |}{res}      6,278        7.18       19.53
{txt}        25 a 44 aÃ±os {c |}{res}     43,985       50.28       69.81
{txt}        45 a 64 aÃ±os {c |}{res}     18,968       21.68       91.49
{txt}       65 aÃ±os y mÃ¡s {c |}{res}      7,444        8.51      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     87,486      100.00
{txt}
{com}. tab pos_ocu if latam ==1 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     43,653       49.90       49.90
{txt}Trabajadores subordinados y remunerados {c |}{res}     26,270       30.03       79.92
{txt}                            Empleadores {c |}{res}      6,045        6.91       86.83
{txt}         Trabajadores por cuenta propia {c |}{res}      9,953       11.38       98.21
{txt}                  Trabajadores sin pago {c |}{res}      1,565        1.79      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}     87,486      100.00
{txt}
{com}. tab emp_ppal if latam ==1 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     43,653       49.90       49.90
{txt}Empleo informal {c |}{res}     24,553       28.07       77.96
{txt}  Empleo formal {c |}{res}     19,280       22.04      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}     87,486      100.00
{txt}
{com}. tab clase2 if latam ==1 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      6,483        7.41        7.41
{txt}   PoblaciÃ³n ocupada {c |}{res}     43,833       50.10       57.51
{txt}PoblaciÃ³n desocupada {c |}{res}      2,548        2.91       60.43
{txt}         Disponibles {c |}{res}      2,698        3.08       63.51
{txt}      No disponibles {c |}{res}     31,924       36.49      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     87,486      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 33,552,984       31.19       31.19
{txt}        14 a 24 aÃ±os {c |}{res} 20,063,279       18.65       49.83
{txt}        25 a 44 aÃ±os {c |}{res} 30,018,512       27.90       77.74
{txt}        45 a 64 aÃ±os {c |}{res} 17,057,252       15.85       93.59
{txt}       65 aÃ±os y mÃ¡s {c |}{res}  6,851,032        6.37       99.96
{txt}Edad no especificado {c |}{res}     44,623        0.04      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}107,587,682      100.00
{txt}
{com}. tab pos_ocu if latam ==0 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 64,067,421       59.55       59.55
{txt}Trabajadores subordinados y remunerados {c |}{res} 28,003,257       26.03       85.58
{txt}                            Empleadores {c |}{res}  2,021,272        1.88       87.46
{txt}         Trabajadores por cuenta propia {c |}{res} 10,069,638        9.36       96.82
{txt}                  Trabajadores sin pago {c |}{res}  3,426,094        3.18      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}107,587,682      100.00
{txt}
{com}. tab emp_ppal if latam ==0 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 64,067,421       59.55       59.55
{txt}Empleo informal {c |}{res} 26,199,659       24.35       83.90
{txt}  Empleo formal {c |}{res} 17,320,602       16.10      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}107,587,682      100.00
{txt}
{com}. tab clase2 if latam ==0 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 26,261,498       24.41       24.41
{txt}   PoblaciÃ³n ocupada {c |}{res} 43,520,261       40.45       64.86
{txt}PoblaciÃ³n desocupada {c |}{res}  1,395,913        1.30       66.16
{txt}         Disponibles {c |}{res}  5,019,007        4.67       70.82
{txt}      No disponibles {c |}{res} 31,391,003       29.18      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}107,587,682      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 33,245,618       31.05       31.05
{txt}        14 a 24 aÃ±os {c |}{res} 19,994,963       18.67       49.72
{txt}        25 a 44 aÃ±os {c |}{res} 29,960,807       27.98       77.71
{txt}        45 a 64 aÃ±os {c |}{res} 17,017,962       15.89       93.60
{txt}       65 aÃ±os y mÃ¡s {c |}{res}  6,809,287        6.36       99.96
{txt}Edad no especificado {c |}{res}     44,623        0.04      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}107,073,260      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 63,660,371       59.45       59.45
{txt}Trabajadores subordinados y remunerados {c |}{res} 27,926,174       26.08       85.54
{txt}                            Empleadores {c |}{res}  2,006,705        1.87       87.41
{txt}         Trabajadores por cuenta propia {c |}{res} 10,060,865        9.40       96.81
{txt}                  Trabajadores sin pago {c |}{res}  3,419,145        3.19      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}107,073,260      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 63,660,371       59.45       59.45
{txt}Empleo informal {c |}{res} 26,133,245       24.41       83.86
{txt}  Empleo formal {c |}{res} 17,279,644       16.14      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}107,073,260      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 26,002,380       24.28       24.28
{txt}   PoblaciÃ³n ocupada {c |}{res} 43,412,889       40.55       64.83
{txt}PoblaciÃ³n desocupada {c |}{res}  1,393,973        1.30       66.13
{txt}         Disponibles {c |}{res}  5,008,376        4.68       70.81
{txt}      No disponibles {c |}{res} 31,255,642       29.19      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}107,073,260      100.00
{txt}
{com}. 
. 
. *** Region Norte
. 
. * Latam
. tab eda5c if latam ==1 & region == 1 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}        399        5.37        5.37
{txt}        14 a 24 aÃ±os {c |}{res}      1,203       16.20       21.57
{txt}        25 a 44 aÃ±os {c |}{res}      4,017       54.08       75.65
{txt}        45 a 64 aÃ±os {c |}{res}      1,226       16.51       92.15
{txt}       65 aÃ±os y mÃ¡s {c |}{res}        583        7.85      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}      7,428      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 1 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}      3,166       42.62       42.62
{txt}Trabajadores subordinados y remunerados {c |}{res}      2,762       37.18       79.81
{txt}                            Empleadores {c |}{res}        677        9.11       88.92
{txt}         Trabajadores por cuenta propia {c |}{res}        823       11.08      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}      7,428      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 1 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}      3,166       42.62       42.62
{txt}Empleo informal {c |}{res}      1,285       17.30       59.92
{txt}  Empleo formal {c |}{res}      2,977       40.08      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}      7,428      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 1 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}        228        3.07        3.07
{txt}   PoblaciÃ³n ocupada {c |}{res}      4,262       57.38       60.45
{txt}         Disponibles {c |}{res}        179        2.41       62.86
{txt}      No disponibles {c |}{res}      2,759       37.14      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}      7,428      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 1 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,746,154       29.83       29.83
{txt}        14 a 24 aÃ±os {c |}{res}  3,538,949       18.37       48.20
{txt}        25 a 44 aÃ±os {c |}{res}  5,596,922       29.05       77.25
{txt}        45 a 64 aÃ±os {c |}{res}  3,146,681       16.33       93.58
{txt}       65 aÃ±os y mÃ¡s {c |}{res}  1,231,907        6.39       99.98
{txt}Edad no especificado {c |}{res}      4,280        0.02      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 19,264,893      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 1 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 11,402,343       59.19       59.19
{txt}Trabajadores subordinados y remunerados {c |}{res}  5,549,890       28.81       88.00
{txt}                            Empleadores {c |}{res}    433,967        2.25       90.25
{txt}         Trabajadores por cuenta propia {c |}{res}  1,529,240        7.94       98.19
{txt}                  Trabajadores sin pago {c |}{res}    349,453        1.81      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 19,264,893      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 1 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 11,402,343       59.19       59.19
{txt}Empleo informal {c |}{res}  3,644,791       18.92       78.11
{txt}  Empleo formal {c |}{res}  4,217,759       21.89      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 19,264,893      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 1 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,490,031       23.31       23.31
{txt}   PoblaciÃ³n ocupada {c |}{res}  7,862,550       40.81       64.12
{txt}PoblaciÃ³n desocupada {c |}{res}    218,892        1.14       65.26
{txt}         Disponibles {c |}{res}    745,431        3.87       69.13
{txt}      No disponibles {c |}{res}  5,947,989       30.87      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 19,264,893      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 1 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,567,982       29.34       29.34
{txt}        14 a 24 aÃ±os {c |}{res}  3,497,655       18.43       47.77
{txt}        25 a 44 aÃ±os {c |}{res}  5,559,641       29.30       77.07
{txt}        45 a 64 aÃ±os {c |}{res}  3,129,468       16.49       93.56
{txt}       65 aÃ±os y mÃ¡s {c |}{res}  1,217,492        6.42       99.98
{txt}Edad no especificado {c |}{res}      4,280        0.02      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 18,976,518      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 1 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 11,173,304       58.88       58.88
{txt}Trabajadores subordinados y remunerados {c |}{res}  5,497,905       28.97       87.85
{txt}                            Empleadores {c |}{res}    431,195        2.27       90.12
{txt}         Trabajadores por cuenta propia {c |}{res}  1,527,186        8.05       98.17
{txt}                  Trabajadores sin pago {c |}{res}    346,928        1.83      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 18,976,518      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 1 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 11,173,304       58.88       58.88
{txt}Empleo informal {c |}{res}  3,601,952       18.98       77.86
{txt}  Empleo formal {c |}{res}  4,201,262       22.14      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 18,976,518      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 1 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,340,937       22.88       22.88
{txt}   PoblaciÃ³n ocupada {c |}{res}  7,803,214       41.12       64.00
{txt}PoblaciÃ³n desocupada {c |}{res}    218,135        1.15       65.15
{txt}         Disponibles {c |}{res}    741,699        3.91       69.05
{txt}      No disponibles {c |}{res}  5,872,533       30.95      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 18,976,518      100.00
{txt}
{com}. 
. 
. *** Region Centro
. 
. * Latam
. tab eda5c if latam ==1 & region == 2 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      8,911       15.52       15.52
{txt}        14 a 24 aÃ±os {c |}{res}      2,454        4.27       19.79
{txt}        25 a 44 aÃ±os {c |}{res}     29,143       50.75       70.54
{txt}        45 a 64 aÃ±os {c |}{res}     11,243       19.58       90.11
{txt}       65 aÃ±os y mÃ¡s {c |}{res}      5,677        9.89      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     57,428      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 2 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     30,053       52.33       52.33
{txt}Trabajadores subordinados y remunerados {c |}{res}     16,764       29.19       81.52
{txt}                            Empleadores {c |}{res}      5,038        8.77       90.30
{txt}         Trabajadores por cuenta propia {c |}{res}      4,998        8.70       99.00
{txt}                  Trabajadores sin pago {c |}{res}        575        1.00      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}     57,428      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 2 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     30,053       52.33       52.33
{txt}Empleo informal {c |}{res}     15,588       27.14       79.48
{txt}  Empleo formal {c |}{res}     11,787       20.52      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}     57,428      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 2 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      5,310        9.25        9.25
{txt}   PoblaciÃ³n ocupada {c |}{res}     27,375       47.67       56.91
{txt}PoblaciÃ³n desocupada {c |}{res}      1,576        2.74       59.66
{txt}         Disponibles {c |}{res}      2,099        3.66       63.31
{txt}      No disponibles {c |}{res}     21,068       36.69      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     57,428      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 2 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 21,810,037       30.81       30.81
{txt}        14 a 24 aÃ±os {c |}{res} 13,184,014       18.62       49.43
{txt}        25 a 44 aÃ±os {c |}{res} 19,857,092       28.05       77.48
{txt}        45 a 64 aÃ±os {c |}{res} 11,393,032       16.09       93.57
{txt}       65 aÃ±os y mÃ¡s {c |}{res}  4,517,990        6.38       99.95
{txt}Edad no especificado {c |}{res}     33,752        0.05      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 70,795,917      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 2 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 42,003,795       59.33       59.33
{txt}Trabajadores subordinados y remunerados {c |}{res} 18,925,807       26.73       86.06
{txt}                            Empleadores {c |}{res}  1,295,868        1.83       87.89
{txt}         Trabajadores por cuenta propia {c |}{res}  6,357,337        8.98       96.87
{txt}                  Trabajadores sin pago {c |}{res}  2,213,110        3.13      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 70,795,917      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 2 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 42,003,795       59.33       59.33
{txt}Empleo informal {c |}{res} 17,574,218       24.82       84.15
{txt}  Empleo formal {c |}{res} 11,217,904       15.85      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 70,795,917      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 2 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 17,078,060       24.12       24.12
{txt}   PoblaciÃ³n ocupada {c |}{res} 28,792,122       40.67       64.79
{txt}PoblaciÃ³n desocupada {c |}{res}  1,053,033        1.49       66.28
{txt}         Disponibles {c |}{res}  3,524,050        4.98       71.26
{txt}      No disponibles {c |}{res} 20,348,652       28.74      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 70,795,917      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 2 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 21,693,761       30.73       30.73
{txt}        14 a 24 aÃ±os {c |}{res} 13,160,180       18.64       49.37
{txt}        25 a 44 aÃ±os {c |}{res} 19,839,766       28.10       77.48
{txt}        45 a 64 aÃ±os {c |}{res} 11,373,195       16.11       93.59
{txt}       65 aÃ±os y mÃ¡s {c |}{res}  4,491,607        6.36       99.95
{txt}Edad no especificado {c |}{res}     33,752        0.05      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 70,592,261      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 2 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 41,843,326       59.27       59.27
{txt}Trabajadores subordinados y remunerados {c |}{res} 18,903,828       26.78       86.05
{txt}                            Empleadores {c |}{res}  1,284,722        1.82       87.87
{txt}         Trabajadores por cuenta propia {c |}{res}  6,350,784        9.00       96.87
{txt}                  Trabajadores sin pago {c |}{res}  2,209,601        3.13      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 70,592,261      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 2 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 41,843,326       59.27       59.27
{txt}Empleo informal {c |}{res} 17,552,823       24.87       84.14
{txt}  Empleo formal {c |}{res} 11,196,112       15.86      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 70,592,261      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 2 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 16,980,532       24.05       24.05
{txt}   PoblaciÃ³n ocupada {c |}{res} 28,748,935       40.73       64.78
{txt}PoblaciÃ³n desocupada {c |}{res}  1,051,938        1.49       66.27
{txt}         Disponibles {c |}{res}  3,517,151        4.98       71.25
{txt}      No disponibles {c |}{res} 20,293,705       28.75      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 70,592,261      100.00
{txt}
{com}. 
. 
. *** Region Sur
. 
. * Latam
. tab eda5c if latam ==1 & region == 3 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      1,501        6.63        6.63
{txt}        14 a 24 aÃ±os {c |}{res}      2,621       11.58       18.21
{txt}        25 a 44 aÃ±os {c |}{res}     10,825       47.83       66.05
{txt}        45 a 64 aÃ±os {c |}{res}      6,499       28.72       94.77
{txt}       65 aÃ±os y mÃ¡s {c |}{res}      1,184        5.23      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     22,630      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 3 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     10,434       46.11       46.11
{txt}Trabajadores subordinados y remunerados {c |}{res}      6,744       29.80       75.91
{txt}                            Empleadores {c |}{res}        330        1.46       77.37
{txt}         Trabajadores por cuenta propia {c |}{res}      4,132       18.26       95.63
{txt}                  Trabajadores sin pago {c |}{res}        990        4.37      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}     22,630      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 3 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     10,434       46.11       46.11
{txt}Empleo informal {c |}{res}      7,680       33.94       80.04
{txt}  Empleo formal {c |}{res}      4,516       19.96      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}     22,630      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 3 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}        945        4.18        4.18
{txt}   PoblaciÃ³n ocupada {c |}{res}     12,196       53.89       58.07
{txt}PoblaciÃ³n desocupada {c |}{res}        972        4.30       62.36
{txt}         Disponibles {c |}{res}        420        1.86       64.22
{txt}      No disponibles {c |}{res}      8,097       35.78      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     22,630      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 3 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,996,793       34.21       34.21
{txt}        14 a 24 aÃ±os {c |}{res}  3,340,316       19.06       53.27
{txt}        25 a 44 aÃ±os {c |}{res}  4,564,498       26.04       79.32
{txt}        45 a 64 aÃ±os {c |}{res}  2,517,539       14.36       93.68
{txt}       65 aÃ±os y mÃ¡s {c |}{res}  1,101,135        6.28       99.96
{txt}Edad no especificado {c |}{res}      6,591        0.04      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 17,526,872      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 3 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 10,661,283       60.83       60.83
{txt}Trabajadores subordinados y remunerados {c |}{res}  3,527,560       20.13       80.95
{txt}                            Empleadores {c |}{res}    291,437        1.66       82.62
{txt}         Trabajadores por cuenta propia {c |}{res}  2,183,061       12.46       95.07
{txt}                  Trabajadores sin pago {c |}{res}    863,531        4.93      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 17,526,872      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 3 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 10,661,283       60.83       60.83
{txt}Empleo informal {c |}{res}  4,980,650       28.42       89.25
{txt}  Empleo formal {c |}{res}  1,884,939       10.75      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 17,526,872      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 3 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,693,407       26.78       26.78
{txt}   PoblaciÃ³n ocupada {c |}{res}  6,865,589       39.17       65.95
{txt}PoblaciÃ³n desocupada {c |}{res}    123,988        0.71       66.66
{txt}         Disponibles {c |}{res}    749,526        4.28       70.93
{txt}      No disponibles {c |}{res}  5,094,362       29.07      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 17,526,872      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 3 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
     poblaciÃ³n de 14 {c |}
   aÃ±os y mÃ¡s: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,983,875       34.18       34.18
{txt}        14 a 24 aÃ±os {c |}{res}  3,337,128       19.06       53.25
{txt}        25 a 44 aÃ±os {c |}{res}  4,561,400       26.06       79.31
{txt}        45 a 64 aÃ±os {c |}{res}  2,515,299       14.37       93.68
{txt}       65 aÃ±os y mÃ¡s {c |}{res}  1,100,188        6.29       99.96
{txt}Edad no especificado {c |}{res}      6,591        0.04      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 17,504,481      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 3 [fweight = fac]

  {txt}ClasificaciÃ³n de la poblaciÃ³n ocupada {c |}
           por posiciÃ³n en la ocupaciÃ³n {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 10,643,741       60.81       60.81
{txt}Trabajadores subordinados y remunerados {c |}{res}  3,524,441       20.13       80.94
{txt}                            Empleadores {c |}{res}    290,788        1.66       82.60
{txt}         Trabajadores por cuenta propia {c |}{res}  2,182,895       12.47       95.07
{txt}                  Trabajadores sin pago {c |}{res}    862,616        4.93      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 17,504,481      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 3 [fweight = fac]

  {txt}ClasificaciÃ³n {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 10,643,741       60.81       60.81
{txt}Empleo informal {c |}{res}  4,978,470       28.44       89.25
{txt}  Empleo formal {c |}{res}  1,882,270       10.75      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 17,504,481      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 3 [fweight = fac]

 {txt}ClasificaciÃ³n de la {c |}
        poblaciÃ³n en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,680,911       26.74       26.74
{txt}   PoblaciÃ³n ocupada {c |}{res}  6,860,740       39.19       65.94
{txt}PoblaciÃ³n desocupada {c |}{res}    123,900        0.71       66.64
{txt}         Disponibles {c |}{res}    749,526        4.28       70.93
{txt}      No disponibles {c |}{res}  5,089,404       29.07      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 17,504,481      100.00
{txt}
{com}. 
. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/sofiacorona/Desktop/Presentacion 24 feb.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Mar 2022, 19:40:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}