{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/sofiacorona/Desktop/Presentacion  4T21 24feb.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Mar 2022, 19:39:28
{txt}
{com}. 
. use "/Users/sofiacorona/Desktop/Bases de Datos/ENOE/SDEMT421.dta"
{txt}
{com}. 
. ****** 4T2021 ********
. 
. rename fac_tri fac
{res}{txt}
{com}. 
. ***generar variable de lugar de nacimiento.
. 
. *** OJO a partir del 3T21 cambió la codificación de los países.  Ahora debemos 
. 
. /* Siempre arrancar con missing para que no se introduzcan los missing en la categoría igual a cero.
> nacido en México = 0, 
> nacido en Guatemala = 1,
> nacido en resto de America = 2, 
> nacido en USA = 3, 
> nacido en Europa = 4, 
> nacido en Africa y Asia = 5 
> nacido en Canada = 6 tambien estan en código 2*/
. 
. generate lugar_nacimiento = .
{txt}(434,826 missing values generated)

{com}. replace lugar_nacimiento = 0 if l_nac_c <= 33
{txt}(422,900 real changes made)

{com}. replace lugar_nacimiento = 1 if l_nac_c == 225 // Guatemala
{txt}(266 real changes made)

{com}. replace lugar_nacimiento = 2 if l_nac_c >= 200 & l_nac_c < 300 & l_nac_c != 225 & l_nac_c != 221
{txt}(1,051 real changes made)

{com}. replace lugar_nacimiento = 3 if l_nac_c == 221 // USA
{txt}(2,302 real changes made)

{com}. replace lugar_nacimiento = 4 if l_nac_c >= 400  &  l_nac_c < 500
{txt}(138 real changes made)

{com}. replace lugar_nacimiento = 5 if l_nac_c >= 100  &  l_nac_c < 200 | l_nac_c >= 300 &  l_nac_c < 400 | l_nac_c >= 500
{txt}(8,169 real changes made)

{com}. 
. 
. *** generar variable de interés, migrantes de latam (incluye Canadá)
. * Dicotómica. Vale uno para los nacidos en guatemala y el resto de america (no incluye USA).  Vale cero para nacidos en México, USA, Europa, Africa y Asia.
. 
. generate latam = .
{txt}(434,826 missing values generated)

{com}. replace latam = 0 if lugar_nacimiento == 0 | lugar_nacimiento == 3 | lugar_nacimiento == 4 |lugar_nacimiento == 5
{txt}(433,509 real changes made)

{com}. replace latam = 1 if lugar_nacimiento == 1  | lugar_nacimiento == 2
{txt}(1,317 real changes made)

{com}. 
. *generar regiones de la República.  Norte = 1, Centro = 2 y Sur = 3.
. 
. generate region = .
{txt}(434,826 missing values generated)

{com}. replace region = 1 if ent == 2 | ent == 3 | ent == 8 | ent == 10 | ent == 25 | ent == 26 | ent == 5 | ent == 19 | ent == 28
{txt}(125,711 real changes made)

{com}. 
. replace region = 2 if ent == 1 | ent == 6 | ent == 9 | ent == 11 | ent == 13 | ent == 14 | ent == 15 | ent == 16 | ent == 17  | ent == 18 | ent == 19 | ent == 21 | ent == 22 | ent == 24 | ent == 29 | ent == 30 | ent == 32
{txt}(226,912 real changes made)

{com}. 
. replace region = 3 if ent == 7 | ent == 12 | ent == 20 | ent == 4 | ent == 23 | ent == 27 | ent == 31
{txt}(96,469 real changes made)

{com}. 
. * generar variable de educación.
. generate grado_edu = .
{txt}(434,826 missing values generated)

{com}. replace grado_edu = 1 if cs_p13_1 <= 2 | cs_p13_1 == 99 // primaria o menos más no sabe
{txt}(137,175 real changes made)

{com}. replace grado_edu = 2 if cs_p13_1 == 3 // secundaria
{txt}(100,604 real changes made)

{com}. replace grado_edu = 3 if cs_p13_1 == 4 | cs_p13_1 == 5 | cs_p13_1 == 6 // preparatoria, normal y carrera técnica
{txt}(88,209 real changes made)

{com}. replace grado_edu = 4 if cs_p13_1 == 7 // profesional
{txt}(68,509 real changes made)

{com}. replace grado_edu = 5 if cs_p13_1 == 8 | cs_p13_1 == 9 // maestria y doctorado
{txt}(5,558 real changes made)

{com}.  
. 
. *tabular educación
. 
. tab grado_edu if latam == 1 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     69,616       29.71       29.71
{txt}          2 {c |}{res}     40,200       17.16       46.86
{txt}          3 {c |}{res}     45,070       19.23       66.10
{txt}          4 {c |}{res}     65,619       28.00       94.10
{txt}          5 {c |}{res}     13,827        5.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    234,332      100.00
{txt}
{com}. tab grado_edu if latam == 0 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res} 43,780,282       36.58       36.58
{txt}          2 {c |}{res} 30,311,653       25.32       61.90
{txt}          3 {c |}{res} 25,537,125       21.34       83.24
{txt}          4 {c |}{res} 18,601,408       15.54       98.78
{txt}          5 {c |}{res}  1,460,622        1.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}119,691,090      100.00
{txt}
{com}. 
. *tabular educación para mayores de 18 años
. 
. tab grado_edu if latam == 1 & eda >= 18 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     52,314       24.72       24.72
{txt}          2 {c |}{res}     35,411       16.73       41.45
{txt}          3 {c |}{res}     44,445       21.00       62.46
{txt}          4 {c |}{res}     65,619       31.01       93.47
{txt}          5 {c |}{res}     13,827        6.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    211,616      100.00
{txt}
{com}. tab grado_edu if latam == 0 & eda >= 18 [fweight = fac]

  {txt}grado_edu {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res} 25,059,203       27.36       27.36
{txt}          2 {c |}{res} 23,210,969       25.35       52.71
{txt}          3 {c |}{res} 23,247,663       25.39       78.10
{txt}          4 {c |}{res} 18,597,541       20.31       98.41
{txt}          5 {c |}{res}  1,460,622        1.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res} 91,575,998      100.00
{txt}
{com}. 
. ******. Generamos Tabuladores *****
. 
. tabulate latam [fweight = fac]

      {txt}latam {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}127,758,946       99.81       99.81
{txt}          1 {c |}{res}    237,105        0.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}127,996,051      100.00
{txt}
{com}. tabulate latam region [fweight = fac], row column
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}              region
     latam {c |}         1          2          3 {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
         0 {c |}{res}  23076132   83686759   20996055 {txt}{c |}{res} 127758946 
           {txt}{c |}{res}     18.06      65.50      16.43 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     99.80      99.88      99.57 {txt}{c |}{res}     99.81 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
         1 {c |}{res}     46353      99414      91338 {txt}{c |}{res}    237105 
           {txt}{c |}{res}     19.55      41.93      38.52 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}      0.20       0.12       0.43 {txt}{c |}{res}      0.19 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}  23122485   83786173   21087393 {txt}{c |}{res} 127996051 
           {txt}{c |}{res}     18.06      65.46      16.48 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. tabulate latam sex [fweight = fac], row column
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}         Sexo
     latam {c |}    Hombre      Mujer {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}  61488047   66270899 {txt}{c |}{res} 127758946 
           {txt}{c |}{res}     48.13      51.87 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     99.82      99.81 {txt}{c |}{res}     99.81 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}    109676     127429 {txt}{c |}{res}    237105 
           {txt}{c |}{res}     46.26      53.74 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}      0.18       0.19 {txt}{c |}{res}      0.19 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}  61597723   66398328 {txt}{c |}{res} 127996051 
           {txt}{c |}{res}     48.12      51.88 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. ** Todas las regiones
. 
. * Latam
. tab eda5c if latam ==1 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}     19,726        8.32        8.32
{txt}        14 a 24 años {c |}{res}     37,664       15.88       24.20
{txt}        25 a 44 años {c |}{res}    101,314       42.73       66.93
{txt}        45 a 64 años {c |}{res}     47,833       20.17       87.11
{txt}       65 años y más {c |}{res}     30,427       12.83       99.94
{txt}Edad no especificado {c |}{res}        141        0.06      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}    237,105      100.00
{txt}
{com}. tab pos_ocu if latam ==1 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}    115,028       48.51       48.51
{txt}Trabajadores subordinados y remunerados {c |}{res}     80,766       34.06       82.58
{txt}                            Empleadores {c |}{res}      5,369        2.26       84.84
{txt}         Trabajadores por cuenta propia {c |}{res}     32,712       13.80       98.64
{txt}                  Trabajadores sin pago {c |}{res}      3,230        1.36      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}    237,105      100.00
{txt}
{com}. tab emp_ppal if latam ==1 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}    115,028       48.51       48.51
{txt}Empleo informal {c |}{res}     79,489       33.52       82.04
{txt}  Empleo formal {c |}{res}     42,588       17.96      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}    237,105      100.00
{txt}
{com}. tab clase2 if latam ==1 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}     13,825        5.83        5.83
{txt}   Población ocupada {c |}{res}    122,077       51.49       57.32
{txt}Población desocupada {c |}{res}      9,363        3.95       61.27
{txt}         Disponibles {c |}{res}     22,020        9.29       70.55
{txt}      No disponibles {c |}{res}     69,820       29.45      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}    237,105      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 29,491,973       23.08       23.08
{txt}        14 a 24 años {c |}{res} 21,749,681       17.02       40.11
{txt}        25 a 44 años {c |}{res} 35,735,884       27.97       68.08
{txt}        45 a 64 años {c |}{res} 28,514,378       22.32       90.40
{txt}       65 años y más {c |}{res} 12,179,731        9.53       99.93
{txt}Edad no especificado {c |}{res}     87,299        0.07      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}127,758,946      100.00
{txt}
{com}. tab pos_ocu if latam ==0 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 70,792,690       55.41       55.41
{txt}Trabajadores subordinados y remunerados {c |}{res} 38,495,022       30.13       85.54
{txt}                            Empleadores {c |}{res}  2,859,898        2.24       87.78
{txt}         Trabajadores por cuenta propia {c |}{res} 12,989,865       10.17       97.95
{txt}                  Trabajadores sin pago {c |}{res}  2,621,471        2.05      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}127,758,946      100.00
{txt}
{com}. tab emp_ppal if latam ==0 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 70,792,690       55.41       55.41
{txt}Empleo informal {c |}{res} 32,004,725       25.05       80.46
{txt}  Empleo formal {c |}{res} 24,961,531       19.54      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}127,758,946      100.00
{txt}
{com}. tab clase2 if latam ==0 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 22,757,503       17.81       17.81
{txt}   Población ocupada {c |}{res} 56,966,256       44.59       62.40
{txt}Población desocupada {c |}{res}  2,151,566        1.68       64.09
{txt}         Disponibles {c |}{res}  7,817,591        6.12       70.20
{txt}      No disponibles {c |}{res} 38,066,030       29.80      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}127,758,946      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 29,173,500       22.98       22.98
{txt}        14 a 24 años {c |}{res} 21,524,195       16.95       39.93
{txt}        25 a 44 años {c |}{res} 35,599,302       28.04       67.97
{txt}        45 a 64 años {c |}{res} 28,453,023       22.41       90.37
{txt}       65 años y más {c |}{res} 12,135,040        9.56       99.93
{txt}Edad no especificado {c |}{res}     86,237        0.07      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}126,971,297      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 70,223,248       55.31       55.31
{txt}Trabajadores subordinados y remunerados {c |}{res} 38,328,006       30.19       85.49
{txt}                            Empleadores {c |}{res}  2,855,548        2.25       87.74
{txt}         Trabajadores por cuenta propia {c |}{res} 12,957,993       10.21       97.95
{txt}                  Trabajadores sin pago {c |}{res}  2,606,502        2.05      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}126,971,297      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 70,223,248       55.31       55.31
{txt}Empleo informal {c |}{res} 31,860,439       25.09       80.40
{txt}  Empleo formal {c |}{res} 24,887,610       19.60      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}126,971,297      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 22,541,304       17.75       17.75
{txt}   Población ocupada {c |}{res} 56,748,049       44.69       62.45
{txt}Población desocupada {c |}{res}  2,146,246        1.69       64.14
{txt}         Disponibles {c |}{res}  7,784,456        6.13       70.27
{txt}      No disponibles {c |}{res} 37,751,242       29.73      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}126,971,297      100.00
{txt}
{com}. 
. 
. *** Region Norte
. 
. * Latam
. tab eda5c if latam ==1 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      7,430       16.03       16.03
{txt}        14 a 24 años {c |}{res}      7,065       15.24       31.27
{txt}        25 a 44 años {c |}{res}     16,495       35.59       66.86
{txt}        45 a 64 años {c |}{res}     10,340       22.31       89.16
{txt}       65 años y más {c |}{res}      5,023       10.84      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     46,353      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 1 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     21,629       46.66       46.66
{txt}Trabajadores subordinados y remunerados {c |}{res}     19,031       41.06       87.72
{txt}                            Empleadores {c |}{res}      1,092        2.36       90.07
{txt}         Trabajadores por cuenta propia {c |}{res}      3,109        6.71       96.78
{txt}                  Trabajadores sin pago {c |}{res}      1,492        3.22      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}     46,353      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 1 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     21,629       46.66       46.66
{txt}Empleo informal {c |}{res}     13,507       29.14       75.80
{txt}  Empleo formal {c |}{res}     11,217       24.20      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}     46,353      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      4,921       10.62       10.62
{txt}   Población ocupada {c |}{res}     24,724       53.34       63.95
{txt}Población desocupada {c |}{res}      1,039        2.24       66.20
{txt}         Disponibles {c |}{res}      2,883        6.22       72.42
{txt}      No disponibles {c |}{res}     12,786       27.58      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     46,353      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,298,466       22.96       22.96
{txt}        14 a 24 años {c |}{res}  4,080,154       17.68       40.64
{txt}        25 a 44 años {c |}{res}  6,360,639       27.56       68.21
{txt}        45 a 64 años {c |}{res}  5,284,690       22.90       91.11
{txt}       65 años y más {c |}{res}  2,039,417        8.84       99.94
{txt}Edad no especificado {c |}{res}     12,766        0.06      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 23,076,132      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 1 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 12,504,121       54.19       54.19
{txt}Trabajadores subordinados y remunerados {c |}{res}  7,868,586       34.10       88.28
{txt}                            Empleadores {c |}{res}    533,714        2.31       90.60
{txt}         Trabajadores por cuenta propia {c |}{res}  1,920,574        8.32       98.92
{txt}                  Trabajadores sin pago {c |}{res}    249,137        1.08      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 23,076,132      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 1 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 12,504,121       54.19       54.19
{txt}Empleo informal {c |}{res}  4,434,732       19.22       73.40
{txt}  Empleo formal {c |}{res}  6,137,279       26.60      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 23,076,132      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,069,071       17.63       17.63
{txt}   Población ocupada {c |}{res} 10,572,011       45.81       63.45
{txt}Población desocupada {c |}{res}    350,510        1.52       64.97
{txt}         Disponibles {c |}{res}  1,296,778        5.62       70.59
{txt}      No disponibles {c |}{res}  6,787,762       29.41      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 23,076,132      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,131,127       22.59       22.59
{txt}        14 a 24 años {c |}{res}  3,979,042       17.52       40.11
{txt}        25 a 44 años {c |}{res}  6,301,168       27.74       67.86
{txt}        45 a 64 años {c |}{res}  5,257,669       23.15       91.01
{txt}       65 años y más {c |}{res}  2,030,432        8.94       99.95
{txt}Edad no especificado {c |}{res}     12,186        0.05      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 22,711,624      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 1 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 12,229,399       53.85       53.85
{txt}Trabajadores subordinados y remunerados {c |}{res}  7,793,197       34.31       88.16
{txt}                            Empleadores {c |}{res}    530,668        2.34       90.50
{txt}         Trabajadores por cuenta propia {c |}{res}  1,912,040        8.42       98.92
{txt}                  Trabajadores sin pago {c |}{res}    246,320        1.08      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 22,711,624      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 1 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 12,229,399       53.85       53.85
{txt}Empleo informal {c |}{res}  4,364,633       19.22       73.06
{txt}  Empleo formal {c |}{res}  6,117,592       26.94      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 22,711,624      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 1 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  3,937,994       17.34       17.34
{txt}   Población ocupada {c |}{res} 10,482,225       46.15       63.49
{txt}Población desocupada {c |}{res}    348,479        1.53       65.03
{txt}         Disponibles {c |}{res}  1,283,199        5.65       70.68
{txt}      No disponibles {c |}{res}  6,659,727       29.32      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 22,711,624      100.00
{txt}
{com}. 
. 
. *** Region Centro
. 
. * Latam
. tab eda5c if latam ==1 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      2,983        3.00        3.00
{txt}        14 a 24 años {c |}{res}     13,528       13.61       16.61
{txt}        25 a 44 años {c |}{res}     40,534       40.77       57.38
{txt}        45 a 64 años {c |}{res}     22,033       22.16       79.54
{txt}       65 años y más {c |}{res}     20,336       20.46      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     99,414      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 2 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     49,891       50.19       50.19
{txt}Trabajadores subordinados y remunerados {c |}{res}     31,856       32.04       82.23
{txt}                            Empleadores {c |}{res}      1,041        1.05       83.28
{txt}         Trabajadores por cuenta propia {c |}{res}     16,114       16.21       99.48
{txt}                  Trabajadores sin pago {c |}{res}        512        0.52      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}     99,414      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 2 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     49,891       50.19       50.19
{txt}Empleo informal {c |}{res}     28,648       28.82       79.00
{txt}  Empleo formal {c |}{res}     20,875       21.00      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}     99,414      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      2,261        2.27        2.27
{txt}   Población ocupada {c |}{res}     49,523       49.81       52.09
{txt}Población desocupada {c |}{res}      3,327        3.35       55.44
{txt}         Disponibles {c |}{res}      9,813        9.87       65.31
{txt}      No disponibles {c |}{res}     34,490       34.69      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     99,414      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 18,584,953       22.21       22.21
{txt}        14 a 24 años {c |}{res} 14,152,183       16.91       39.12
{txt}        25 a 44 años {c |}{res} 23,570,218       28.16       67.28
{txt}        45 a 64 años {c |}{res} 18,999,199       22.70       89.99
{txt}       65 años y más {c |}{res}  8,315,862        9.94       99.92
{txt}Edad no especificado {c |}{res}     64,344        0.08      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 83,686,759      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 2 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 46,313,587       55.34       55.34
{txt}Trabajadores subordinados y remunerados {c |}{res} 25,772,436       30.80       86.14
{txt}                            Empleadores {c |}{res}  1,829,753        2.19       88.32
{txt}         Trabajadores por cuenta propia {c |}{res}  8,263,740        9.87       98.20
{txt}                  Trabajadores sin pago {c |}{res}  1,507,243        1.80      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 83,686,759      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 2 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 46,313,587       55.34       55.34
{txt}Empleo informal {c |}{res} 21,171,360       25.30       80.64
{txt}  Empleo formal {c |}{res} 16,201,812       19.36      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 83,686,759      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 14,293,602       17.08       17.08
{txt}   Población ocupada {c |}{res} 37,373,172       44.66       61.74
{txt}Población desocupada {c |}{res}  1,551,303        1.85       63.59
{txt}         Disponibles {c |}{res}  5,029,420        6.01       69.60
{txt}      No disponibles {c |}{res} 25,439,262       30.40      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 83,686,759      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 18,453,433       22.15       22.15
{txt}        14 a 24 años {c |}{res} 14,040,558       16.85       39.00
{txt}        25 a 44 años {c |}{res} 23,499,733       28.21       67.21
{txt}        45 a 64 años {c |}{res} 18,969,210       22.77       89.98
{txt}       65 años y más {c |}{res}  8,284,562        9.94       99.92
{txt}Edad no especificado {c |}{res}     63,862        0.08      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 83,311,358      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 2 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 46,053,159       55.28       55.28
{txt}Trabajadores subordinados y remunerados {c |}{res} 25,687,372       30.83       86.11
{txt}                            Empleadores {c |}{res}  1,828,738        2.20       88.31
{txt}         Trabajadores por cuenta propia {c |}{res}  8,244,522        9.90       98.20
{txt}                  Trabajadores sin pago {c |}{res}  1,497,567        1.80      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 83,311,358      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 2 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 46,053,159       55.28       55.28
{txt}Empleo informal {c |}{res} 21,107,957       25.34       80.61
{txt}  Empleo formal {c |}{res} 16,150,242       19.39      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 83,311,358      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 2 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res} 14,214,199       17.06       17.06
{txt}   Población ocupada {c |}{res} 37,258,199       44.72       61.78
{txt}Población desocupada {c |}{res}  1,548,014        1.86       63.64
{txt}         Disponibles {c |}{res}  5,013,083        6.02       69.66
{txt}      No disponibles {c |}{res} 25,277,863       30.34      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 83,311,358      100.00
{txt}
{com}. 
. 
. *** Region Sur
. 
. * Latam
. tab eda5c if latam ==1 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      9,313       10.20       10.20
{txt}        14 a 24 años {c |}{res}     17,071       18.69       28.89
{txt}        25 a 44 años {c |}{res}     44,285       48.48       77.37
{txt}        45 a 64 años {c |}{res}     15,460       16.93       94.30
{txt}       65 años y más {c |}{res}      5,068        5.55       99.85
{txt}Edad no especificado {c |}{res}        141        0.15      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     91,338      100.00
{txt}
{com}. tab pos_ocu if latam ==1 & region == 3 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res}     43,508       47.63       47.63
{txt}Trabajadores subordinados y remunerados {c |}{res}     29,879       32.71       80.35
{txt}                            Empleadores {c |}{res}      3,236        3.54       83.89
{txt}         Trabajadores por cuenta propia {c |}{res}     13,489       14.77       98.66
{txt}                  Trabajadores sin pago {c |}{res}      1,226        1.34      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}     91,338      100.00
{txt}
{com}. tab emp_ppal if latam ==1 & region == 3 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res}     43,508       47.63       47.63
{txt}Empleo informal {c |}{res}     37,334       40.87       88.51
{txt}  Empleo formal {c |}{res}     10,496       11.49      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res}     91,338      100.00
{txt}
{com}. tab clase2 if latam ==1 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}      6,643        7.27        7.27
{txt}   Población ocupada {c |}{res}     47,830       52.37       59.64
{txt}Población desocupada {c |}{res}      4,997        5.47       65.11
{txt}         Disponibles {c |}{res}      9,324       10.21       75.32
{txt}      No disponibles {c |}{res}     22,544       24.68      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     91,338      100.00
{txt}
{com}. 
. * Non Latam
. tab eda5c if latam ==0 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,608,554       26.71       26.71
{txt}        14 a 24 años {c |}{res}  3,517,344       16.75       43.46
{txt}        25 a 44 años {c |}{res}  5,805,027       27.65       71.11
{txt}        45 a 64 años {c |}{res}  4,230,489       20.15       91.26
{txt}       65 años y más {c |}{res}  1,824,452        8.69       99.95
{txt}Edad no especificado {c |}{res}     10,189        0.05      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 20,996,055      100.00
{txt}
{com}. tab pos_ocu if latam ==0 & region == 3 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 11,974,982       57.03       57.03
{txt}Trabajadores subordinados y remunerados {c |}{res}  4,854,000       23.12       80.15
{txt}                            Empleadores {c |}{res}    496,431        2.36       82.52
{txt}         Trabajadores por cuenta propia {c |}{res}  2,805,551       13.36       95.88
{txt}                  Trabajadores sin pago {c |}{res}    865,091        4.12      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 20,996,055      100.00
{txt}
{com}. tab emp_ppal if latam ==0 & region == 3 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 11,974,982       57.03       57.03
{txt}Empleo informal {c |}{res}  6,398,633       30.48       87.51
{txt}  Empleo formal {c |}{res}  2,622,440       12.49      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 20,996,055      100.00
{txt}
{com}. tab clase2 if latam ==0 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,394,830       20.93       20.93
{txt}   Población ocupada {c |}{res}  9,021,073       42.97       63.90
{txt}Población desocupada {c |}{res}    249,753        1.19       65.09
{txt}         Disponibles {c |}{res}  1,491,393        7.10       72.19
{txt}      No disponibles {c |}{res}  5,839,006       27.81      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 20,996,055      100.00
{txt}
{com}. 
. * Mexicanos
. tab eda5c if lugar_nacimiento ==0 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
     población de 14 {c |}
   años y más: Grupo {c |}
       edad 5 claves {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  5,588,940       26.68       26.68
{txt}        14 a 24 años {c |}{res}  3,504,595       16.73       43.41
{txt}        25 a 44 años {c |}{res}  5,798,401       27.68       71.09
{txt}        45 a 64 años {c |}{res}  4,226,144       20.17       91.26
{txt}       65 años y más {c |}{res}  1,820,046        8.69       99.95
{txt}Edad no especificado {c |}{res}     10,189        0.05      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 20,948,315      100.00
{txt}
{com}. tab pos_ocu if lugar_nacimiento ==0 & region == 3 [fweight = fac]

  {txt}Clasificación de la población ocupada {c |}
           por posición en la ocupación {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                              No aplica {c |}{res} 11,940,690       57.00       57.00
{txt}Trabajadores subordinados y remunerados {c |}{res}  4,847,437       23.14       80.14
{txt}                            Empleadores {c |}{res}    496,142        2.37       82.51
{txt}         Trabajadores por cuenta propia {c |}{res}  2,801,431       13.37       95.88
{txt}                  Trabajadores sin pago {c |}{res}    862,615        4.12      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res} 20,948,315      100.00
{txt}
{com}. tab emp_ppal if lugar_nacimiento ==0 & region == 3 [fweight = fac]

  {txt}Clasificación {c |}
     de empleos {c |}
     formales e {c |}
  informales de {c |}
     la primera {c |}
      actividad {c |}      Freq.     Percent        Cum.
{hline 16}{c +}{hline 35}
      No aplica {c |}{res} 11,940,690       57.00       57.00
{txt}Empleo informal {c |}{res}  6,387,849       30.49       87.49
{txt}  Empleo formal {c |}{res}  2,619,776       12.51      100.00
{txt}{hline 16}{c +}{hline 35}
          Total {c |}{res} 20,948,315      100.00
{txt}
{com}. tab clase2 if lugar_nacimiento ==0 & region == 3 [fweight = fac]

 {txt}Clasificación de la {c |}
        población en {c |}
           ocupada y {c |}
         desocupada; {c |}
     disponible y no {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
           No aplica {c |}{res}  4,389,111       20.95       20.95
{txt}   Población ocupada {c |}{res}  9,007,625       43.00       63.95
{txt}Población desocupada {c |}{res}    249,753        1.19       65.14
{txt}         Disponibles {c |}{res}  1,488,174        7.10       72.25
{txt}      No disponibles {c |}{res}  5,813,652       27.75      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res} 20,948,315      100.00
{txt}
{com}. 
. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/sofiacorona/Desktop/Presentacion  4T21 24feb.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Mar 2022, 19:39:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}